Repository: wp-plugins/avatar-manager
Catalog: languages/avatar-manager-*.po
Languages: ro_ro

source: Avatar Uploads
ro_ro: Încărcare Avatare

source: Default Size
ro_ro: Dimensiune Implicită

source: Anyone can upload
ro_ro: Oricine poate încărca

source: Default size of the avatar image
ro_ro: Dimensiunea implicită a avatarului

source: Display this avatar
ro_ro: Afișează acest avatar

source: <a href="http://codex.wordpress.org/How_to_Use_Gravatars_in_WordPress" target="_blank">More information</a>
ro_ro: <a href="http://codex.wordpress.org/How_to_Use_Gravatars_in_WordPress" target="_blank">Mai multe informații</a>

source: Custom
ro_ro: Personalizat

source: Delete
ro_ro: Șterge

source: Select Image
ro_ro: Selecție Imagine

source: Choose an image from your computer:
ro_ro: Alege o imagine din calculator:

source: Upload
ro_ro: Încarcă

source: Avatar Rating
ro_ro: Evaluare Avatar

source: G &#8212; Suitable for all audiences
ro_ro: G &#8212; Potrivit tuturor categoriilor de public

source: PG &#8212; Possibly offensive, usually for audiences 13 and above
ro_ro: PG &#8212; Posibil ofensator, de regulă pentru publicul peste 13 ani

source: R &#8212; Intended for adult audiences above 17
ro_ro: R &#8212; Destinat publicului adult peste 17 ani

source: X &#8212; Even more mature than above
ro_ro: X &#8212; Chiar mai matur decât cele anterioare

source: Choose a rating for your custom avatar.
ro_ro: Alege o evaluare pentru avatarul personalizat.

source: Image Upload Error
ro_ro: Eroare Încărcare Imagine

source: Avatar Image
ro_ro: Imagine Avatar
